{"meta":{"title":"Study Archive","subtitle":"Student forever","description":"","author":"李紀風","url":"http://example.com","root":"/"},"pages":[{"title":"tags","date":"2023-01-30T13:19:25.000Z","updated":"2023-01-30T13:40:21.184Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Chemical Properties of Solvents","slug":"ions-2","date":"2023-02-11T07:54:02.000Z","updated":"2023-02-12T04:04:50.345Z","comments":true,"path":"2023/02/11/ions-2/","link":"","permalink":"http://example.com/2023/02/11/ions-2/","excerpt":"The chemical properties of solvents that are relevant to their dissolution abilities for electrolytes and the ionic dissociation of the latter include their structuredness or self‐association and their donor (electron pair donation, basicity) and acceptor (hydrogen bonding ability, acidity) properties as well as their softness. The mutual solubility with other solvents, in particular water, is also of importance as are the windows for making spectroscopic and electrochemical measurements on solutions of ions in the solvents.","text":"The chemical properties of solvents that are relevant to their dissolution abilities for electrolytes and the ionic dissociation of the latter include their structuredness or self‐association and their donor (electron pair donation, basicity) and acceptor (hydrogen bonding ability, acidity) properties as well as their softness. The mutual solubility with other solvents, in particular water, is also of importance as are the windows for making spectroscopic and electrochemical measurements on solutions of ions in the solvents. Structuredness It is to be hoped that the days are long past when a solvent was considered solely as a medium in which solute species moved about. Much time and effort has been expended in demonstrating the relevance of solute-solvent interactions to the free energy of a solute. This endeavour has more recently been focused on the connection between solvent structure and the energetics of dissolved solutes. The breakdown of this structure is necessary for the creation of a hole to accommodate a solute[1]. The structuredness of solvents is closely related to their self‐association by means of hydrogen bonds or dipole–dipole interactions. solvent structuredness involves the use of two solvent properties-internal pressure and cohesive energy density Cohesive energy density is a measure of the total molecular cohesion per of a solvent, and its magnitude is given by where and are the energy and latent heat of vaporization of the solvent, respectively, and is the molar volume. On vaporization of one mole of solvent, all intermolecular bonds associated with that mole will be broken (assuming negligible interaction in the vapour phase). Thus, , represents the total strength or stiffness of the solvent structure. On the other hand, internal pressure is a measure of the change in internal energy of a solvent as it undergoes a very small isothermal expansion. The magnitude of Pint is , so that at ambient conditions and saturation vapor pressures, the last term, − can be neglected. To understand the physical significance of , one must consider a solvent undergoing a small isothermal expansion. The small expansion does not disrupt all the intermolecular interactions associated with of the solvent. The most important contributions to will come from those interactions varying most rapidly near the equilibrium separation in the solvent. Dispersion, repulsion and dipole-dipole interactions all vary rapidly with intermolecular separation, and so we might expect to reflect mainly these interactions. Thus, the stiffness of solvent is the difference between molar internal energy and internal pressure In the cases of solvents with a hydrogen‐bonded tri-dimensional network, foremost water (both h2O and d2O) but also ethylene glycol, glycerol, and formamide, to name a few, the average number of hydrogen bonds existing in the liquid solvent per solvent molecule is an excellent measure of their structuredness. It depends on external conditions, such as the temperature and pressure, and on the presence of solutes that affect this hydrogen‐bonded structure. The appearance of intermolecular hydrogen bonding in a solvent substantially increases the cohesion of that solvent as measured by , but less difference in . In this case, the value of of water is by larger than for other structureed solvents. Solvent properties realted to their ion solvating ability The molecules of solvents have several features that enable them to solvate ions effectively. These include the polarity, measured by the dipole moment, , and the molecular polarizability, , of individual molecules, but have other manifestations in the bulk liquid solvent. The solvents generally include donor atoms that have one or more pairs of free electrons and some are protic and can donate a hydrogen atom toward the formation of hydrogen bonds and can accept a pair of electrons from a donor atom. even aprotic solvents may be protogenic, in that under suitable circumstances, their electronic structure can be rearranged so as to make a hydrogen atom available for hydrogen bonding. I will detail these concepts in the following sections. Polarity The empirical “like-dissolves-like” rule is a vague conclusion but always goes well in solvent solubility. Therefore, polar solvents dissolve polar solutes and nonpolar solvents dissolve nonpolar solutes. we can observe that iodine (a nonpolar species) dissolves readily in 1,1,1-trichloroethane (a nonpolar solvent), but does not dissolve in water (a polar solvent). Immiscibility of liquids with different polarities can also be demonstrated by the failure of the trichloroethane and water to mix. However, this definition is rather arbitrary and has not been widely used in subsequent literature. Even with a definition at hand, it is difficult to know quantitatively how “like” two liquids need to be in order to be miscible. Recent research used field-theoretic variational methods and formulated a first-principles molecular-based theory for dipole-dipole interactions in liquid mixtures[2]. This paper quantify the theory of \"like-dissolve-like\", and could be a feasible method for solvent selection. But it is too complicated to easily handle (😅). Electron pair donicity and ability to accept a hydrogen bond The ability of solvent molecules to donate a free electron pair from their donor atoms (O, N, S) to coordinate with acceptor atoms of solutes is a measure of the solvent donicity. It can also be construed as its basicity in the Lewis and the Brönsted senses, because it also describes the ability of the solvent molecules to accept a proton from a Brönsted acid to be protonated or to form a hydrogen bond. This property is expressed in terms of the Gutmann donor number DN, which is the negative of the standard molar enthalpy of reaction of the solvent with the Lewis acid antimony pentachloride, both in dilute solution in the inert solvent 1,2-dichloroethane (in units). It is assumed that this quantity, pertaining to solvent molecules in dilute solution, represents also the property of the bulk solvent. It is also to be noted that for solvents associated by hydrogen bond networks (water and alkanols), their molecules in dilute solution in inert solvents have considerably lower values than those for the bulk solvents, in which the cooperative effect of the hydrogen bonding enhances the donicity. Hydrogen bond donicity and electron pair acceptance The electron pair acceptance propensity of the molecules of a solvent are closely related to its ability to provide protons for hydrogen bonding, and hence is confined to protic or at least protogenic solvents among those on our list. The latter solvents include chloro-form and solvent having a methyl group adjacent to a , , or group. The Gutmann–Mayer acceptor number scale AN uses the NMR chemical shift δ of the atom of riethylphosphine oxide as the electron‐pair donor probe in dilute solution in the solvent to be studied relative to the shift in n‐hexane. Softness a further property of solvents that is relevant to their solvation of ions is their softness. The general rule that soft solvents preferably solvate soft ions and hard solvents do so for hard ions is valid (\"like-dissolves-like\"). Among the solvents on our list, the majority is hard (they have oxygen donor atoms) but a few are soft—pyridine, acetonitrile, tetrahydrothiophene, and these indeed solvate soft cations more strongly than expected from other properties that they have. On the other hand, the solvation of soft anions by the soft solvents is not particularly enhanced. The softness of solvents is best expressed by the difference of , the standard molar Gibbs energy of transfer from water as the source solvent to the target solvent under study, of silver ions on the one hand and the mean of the values for sodium and potassium on the other: Other measures of solvent softness have also been established by using the raman spectrum of the (soft) mercury bromide or the infrared spectrum of iodine cyanide. Solvent as acids and bases The electron pair donicity and acceptance ability of solvent molecules are reflected in their bulk properties. They are, of course, related to their reactions as acids and bases pertaining specifically to the deprotonation or protonation in the gas phase, on the one hand, and these reactions in dilute solutions in a reference solvent (water) on the other, as well as their autoprotolysis as pure liquids. The deprotonation of gaseous molecules of protic or protogenic solvents is measured by the standard molar Gibbs energy, , of the reaction where stands for a protic solvent molecule. The protonation of gaseous solvent molecules is measured by the standard molar enthalpy, called proton affinity, PA, of the reaction , where stands for a solvent molecule. Miscibility with and solubility in water aqueous solutions of electrolytes that dissociate into ions have been and are studied so extensively that it is natural to enquire about the solutions of electrolytes in binary mixtures of water and cosolvents. related to the mutual solubility of solvents with water is their lipophilicity or hydrophobicity that can be described by (the logarithm of) their partition coefficient between n‐octanol and water, . The more hydrophobic a substance is, the larger the value of for its partition. A linear expression connects the solubility of the solvent in water with this partition coefficient: it is noted that the majority of solvents generally used for the dissolution of electrolytes are completely miscible with water and are very hydrophilic, having negative values of .","categories":[],"tags":[{"name":"fundamental theories","slug":"fundamental-theories","permalink":"http://example.com/tags/fundamental-theories/"},{"name":"Marcus","slug":"Marcus","permalink":"http://example.com/tags/Marcus/"},{"name":"solvent","slug":"solvent","permalink":"http://example.com/tags/solvent/"}]},{"title":"Ions and Their Properties-Intro","slug":"Ions-1","date":"2023-02-09T12:48:14.000Z","updated":"2023-02-11T15:32:17.971Z","comments":true,"path":"2023/02/09/Ions-1/","link":"","permalink":"http://example.com/2023/02/09/Ions-1/","excerpt":"","text":"Ions as Isolated Particles-Intro Isolated or Bare ions: Ions in an ideal gaseous state are devoid of interactions with other particles or their surroundings are commonly monatomic or consist of relatively few atoms. They may also be the centers of clusters consisting of the ion proper surrounded by a small number of solvent molecules. Ionization potential: An isolated ion is formed from an atom, a radical, or a molecule by either losing one or more electrons in an ionization process to form a cation or gaining an electron in an electron capture process to form an anion. The ionization process may proceed in several successive stages and requires the investment of energy. This energy is expressed by the ionization potential, , the sum is over the successive ionization stages. For metallic elements forming cation , the ionization potentials are the differences in the standard enthalpies of formation of the cation and the metal atoms in the ideal gas phase. Electron affinity: The electron capture by a neutral species releases energy, the amount expressed as its electron affinity, EA. The value of EA is generally based on the appearance potentials in mass spectroscopy. Thermodynamic quantities: The value of the Gibbs energies is obtained from the enthalpies and entropies. For monatomic ions with no unpaired electrons, the standard molar entropy reflects the translational entropy alone and depends only on the ion's mass. The standard molar entropy is expressed as follows. Where is the relative molar mass. ...... OK, there are too many concepts in this chapter, and I have no patience to continue listing them. If you want to know some basic concepts in this book, just download it, and check it.💪","categories":[],"tags":[{"name":"fundamental theories","slug":"fundamental-theories","permalink":"http://example.com/tags/fundamental-theories/"},{"name":"Marcus","slug":"Marcus","permalink":"http://example.com/tags/Marcus/"},{"name":"ions","slug":"ions","permalink":"http://example.com/tags/ions/"}]},{"title":"Some confusing concepts in electrochemistry","slug":"confusing-in-electrochemistry","date":"2023-01-30T07:26:22.000Z","updated":"2023-02-11T05:17:06.627Z","comments":true,"path":"2023/01/30/confusing-in-electrochemistry/","link":"","permalink":"http://example.com/2023/01/30/confusing-in-electrochemistry/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Electrode Potential","slug":"electrode-potential","date":"2023-01-30T06:14:30.000Z","updated":"2023-02-10T05:52:19.629Z","comments":true,"path":"2023/01/30/electrode-potential/","link":"","permalink":"http://example.com/2023/01/30/electrode-potential/","excerpt":"Several fundamental properties related to electrode potential","text":"Several fundamental properties related to electrode potential Figure 1: The definition of several potentials relate to the surface excess charges and chemical potential of the conductor Outer Potential/ Volta Potential Definition: In a vacuum, the electric work is done by transferring a unit negative charge from infinity to point away from phase is called the external potential of the conductor . The whole process only does electric work. Because point A is still in a vacuum, The short-range force between the charged particle (ion, electron, etc.) and conductor has not yet occurred. The outer potential is measurable. Requirements for the unit charge \"The unit charge being transported only tests (or “probes”) the charge on the metal. The unit test charge must not itself interact with the metal; it should only sense the charge on the metal. It must be a spectator, not an actor.\" \"Modern Electrochemistry 2A\" Surface Potential Definition: The electric work done by transferring the unit negative charge from point away from the conductor phase , across the interface dipole layer, to point C in the phase is called the surface potential of the conductor . The whole process only does electric work. Apparently, in this transferring process, there is not only electric work but chemical effect work (chemical potential). However, separating electrical or chemical effect work from the transferring process is impossible. Besides, closely relates to the properties of conductor material and its surface structure. Therefore, is unmeasurable. Figure 2. Causes of metal surface potential In the bulk phase, the density of free electrons is equal everywhere. The electron density in the surface area decreases with the distance from the surface. In the metal surface, the electrons are imbalanced. They tend to come out of the metal surface and enter the vacuum to reduce the kinetic energy. The distance between these electrons and the positive ion nucleus increases, and the potential energy increases. The two factors work together to reach an equilibrium. Spill Over: When the temperature rises, some electrons are excited, and the quantum tunneling effect occurs, so that they can be distributed within away from the metal surface Chemical Potential Definition: The short-rang interaction work done by reversibly transferring the unit molar species from point away from the conductor phase , across the interfacial dipole layer, to point C in the phase is called the chemical potential of the conductor . Real Potential Transferring unit molar species with charge number from point away from the conductor phase needs to overcome both the surface potential and the chemical potential of the point in the phase . Inner Potential/ Galvani Potential Figure 3. Illustration of inner potential Definition: In a vacuum, the electric work is done by transferring the unit negative charge from infinite to a point in the phase is called the inner potential. As illustrated in Figure 3, the inner potential is the sum of surface potential and outer potential. The electrostatic term associated with crossing the layer of interfacial-orientated dipoles, and another electrostatic term associated with the charge on the phase. Electrochemical Potential Definition: The total work done by reversibly transferring the unit molar species with charge number from infinity to a point in the phase is equal to the electrochemical potential of species in the phase . The whole process contains long-range work and short-range work, which is The deduced equation decomposes the electrochemical potential to the chemical work and electric work . The work function of metal Definition: The minimal work done by moving an electron from an uncharged conductor in a vacuum to the outer surface in point A. The process must overcome the chemical interaction between electron and inner particles and transport through the interfacial dipole layer. It is the same as taking an electron from the Fermi energy level of metal to the surface of the metal. According to the definition of the work function, it is surprising to know that it is precisely opposite to the real potential. What is electrode potential? Absolute electrode potential Firstly, we need to consider the electrode reaction's equilibrium condition. Actually, in the interface of electrode and electrolyte in an equilibrium state, the competitiveness of oxidation reaction and reduction reaction is equal (shown in Figure 4) Figure 4. The equilibrium condition of the electrode reaction The electron exchange (redox reaction) happens between the electrode and redox species. When it reaches the equilibrium state, the algebraic sum of the electrochemical potential of reactant(s) and product(s) (including electrons) is equal to zero. Further decomposing the electrochemical potential will lead to the following equation. Since metal is in brimming with electrons, here we suppose the activity of electrons in metal electrode M is equal to 1 (); Besides, in a redox reaction , there always has and \"\" indicates the negative charge of electrons. Therefore, Compared with the Nernst equation of redox electrode, we could assume an expression of absolute electrode potential But is this assumption correct? We can rationalize this definition of absolute electrode potential by designing a specific cell, as depicted in Figure 5. The and are the same kind of meta () for the electrode to be measured (work electrode) and the current collector of the reference electrode (Ref). Figure 5. The diagram of the designed cell The open circuit voltage (OCV) directly relates to the electrochemical potential difference of both sides. The tested OCV from an external circuit equals the sum of all the interfacial potential differences inside the cell. To get a stable result of OCV, the electrons between M' and Ref are in electrochemical equilibrium. Combining the above equations, we get Recalling the proposed definition of absolute electrode potential, such a designed cell's OCV (E) equals the absolute electrode potential difference between the work electrode and reference electrode. To this point, the definition of absolute electrode potential successfully applies to the specific cell with the same material for the working electrode and the current collector of the reference electrode. Further details of the logical explanation can be seen in \"电极过程动力学导论\" by 查全性. Above all, we can accurately express the definition of absolute electrode potential in an electrode/electrolyte interface. How to understand the absolute electrode potential? From the viewpoint of work Now, we look at the left side of the absolute electrode potential equation. It is not clear about the relation with work from this expression, but we can further deduce this equation. Now, if we product the charges of electrons () in the both left and right side of the equation, we can conclude that the absolute electrode potential (product Fraday constant ) is equal to the whole worke done by transferring electrons from the Fermi levels of metal electrode to a vacuum and then move to the inner point of electrolyte (Figure 6). Illustration of absolute electrode potential from work viewpoint Meanwhile, we can conclude from the above equation that the more work needed, the species are harder to accept electrons from metal electrode, which cooresponding to the higher equilibrium electrode potential. From the view point of Gibbs free energy When a redox reaction reachs its equilibrium, the abolute electrode potential has an alternative expression From this equation, we could define the standerd absolute electrode potential The standerd absolute electrode potential cooresponds to the change of standerd Gibbs free energy in reaction: . In thermodynamics, the more negative the is, the reaction is more likely to forward occur, accordingly, is harder to occur. In the case of total reaction including both sides of electrode reaction, where is equal to the difference in absolute electrode potential between the positive electrode and the negative electrode (discussed above), Then considering each absolute electrode potential, So, the case is that the change of Gibbs free energy of the total cell reaction is the sum of the changes of Gibbs free energy of each electrode reaction. Note to say that the electrons terms are not included. From the viewpoint of electric work Figure 7. Relationships among electronic states at an interface between a metal electrode and a solution containing species O and R at equal concentrations. The metal electrode can be considered as the reservoir of electrons or \"electrons ocean\". When the value of equilibrium electrode potential is more negative, the ocean level is higher, which greater the potential of electrons to do external work. There are two more concepts need to address. Metal's Fermi level: the energy level where electron occupation probability in metal equals to when . Liquid's Fermi level: the energy level where redox pair occupation probability in solution equals to . A stable interfacial potential difference is constructed when the electrode reaction reaches equilibrium. At this time, both the metal and the solution have a specific internal potential, and the electrons on the Fermi level of the metal have specific electrostatic potential energy and electrochemical potential. The electrons on the Fermi energy level of the metal and the Fermi energy level of the Redox pair in the solution at the time of reaction equilibrium are equal. Under the applied potential, The Nernst electrode process corresponds to the relation that the ability of the electrode potential represent the metal to give electrons to the redox pair in the solution. Figure 8. The Nernst electrode process To summarize all the above, the electrode potential strongly depends on the electrode reaction, and we can explain this potential through different methods or viewpoints. The core concept is the description of electron transfer. The above theory may not fully explain the mysterious electrode potential, but it is an excellent introduction to a broader world of electrochemistry.","categories":[],"tags":[{"name":"fundamental theories","slug":"fundamental-theories","permalink":"http://example.com/tags/fundamental-theories/"}]},{"title":"Thermodynamics of Electrochemistry","slug":"thermodynamics-basic","date":"2023-01-28T16:58:23.000Z","updated":"2023-02-11T08:01:14.685Z","comments":true,"path":"2023/01/29/thermodynamics-basic/","link":"","permalink":"http://example.com/2023/01/29/thermodynamics-basic/","excerpt":"Thermodynamics of reversible batteries Basics of thermodynamics of electrochemistry Faraday's Law During electrolysis, the amount of substance precipitated on the electrode is proportional to the excess charge.","text":"Thermodynamics of reversible batteries Basics of thermodynamics of electrochemistry Faraday's Law During electrolysis, the amount of substance precipitated on the electrode is proportional to the excess charge. Where the faraday constant is The represent the faraday law applied in a more sepecific condition of electrochemial process. The first term is sum of the excess charge of parallel electrochemical reactions. The second term relate to the charging current. Zeroth law of thermodynamics Several phases/systems in contact with each other are in thermal equilibrium condition: all strength properties (temperature, pressure, chemical potential, electrochemical potential) of each phase/system are equal State functions A system is defined by its own state functions and has nothing to do with its history and environment Entropy Definition of statistical thermodynamics where is the number of all microstates in a system, assuming that the probability of each microstate is equal. Another definition relate to termal energy When a system worked externally near reversibility, the exchanged heat with environment is minimal, and cooresponding to the change of entropy. Internal Energy Internal energy of single-phase multi-component system The expression of the internal energy change of the system, including the input heat energy to the system when changing the entropy, the energy change caused by doing the volume work, and the Gibbs free energy (Non-volume work in reverible system) change caused by doing the chemical work when adding some substances to the system. Internal energy of dual-phase multi-component system The change of GIbbs free energy is described as adding substrance into enery phase and summing the total change chemical potential changes of the system . This term can be the result of (electro)chemical reaction for a closed system; Besides, the surface energy (phase interphase free energy) is reprensent as . Surfance energy is not independent of other state functions, the term is not account. Gibbs free energy Gibbs free energy of single-phase multi-component system Generally, the research of electrochemistry is conduct under a isothermo and isopressure conditon. The change of Gibbs free energy can be reduced as In the above case, the chemical reaction inside the system is the sole contribution of the Gibbs free energy change. Similarly, the Gibbs free energy of dual-phase multi-component system State functions description of electrode/electrolyte interface Gibbs free energy descriptor for electrode/electrolyte is better than internal energy. SInce most electrochemical processes happened on the interface is in a condition, and Gibbs free energy is directly related to the non-volume work including electrical work and chemical potential. Gibbs free energy of single-phase charged system Where : inner potential/Galvani potential of the phase; : the excess charge represents the variations in charge associated with the addition of species . In the process of adding the charged substance to the phase, chemical work and electrical work need to be done at the same time. Chemical work and electrical work are occurring at the same time, which is indistinguishable. Thus, the electrochemical potential is defined (note: ). Behind the definition of electrochemical potential, there is a basic assumptions that the phase within the charged particle is large enough, and adding charged particles does not change the internal potential of the modified phase. i.e. is indenpendent of . \"The electrochemical potential is a measure of the work needed to move one mole of ions from a vacuum into a phase, at constant pressure and temperature. Nevertheless, absolutely speaking, it is impossible to add ions to a phase without changing its charge and therefore its outer potential. Consequently, the notion of electrochemical potential defined by this is a virtual one.\" \"ANALYTICAL and PHYSICAL ELECTROCHEMISTRY\" by HubertH .Girault Gibbs free energy of electrochemical system The electrochemical system is usually an open system containing multiphase, multi-component and charged particles, which can exchange materials and energy with the environment. The process in the electrochemical reaction system is usually carried out under constant surface area and isothermal and isopressure of each interface. When equilibrium is achieved, the inner potential of each phase remains unchanged.","categories":[],"tags":[{"name":"fundamental theories","slug":"fundamental-theories","permalink":"http://example.com/tags/fundamental-theories/"}]}],"categories":[],"tags":[{"name":"fundamental theories","slug":"fundamental-theories","permalink":"http://example.com/tags/fundamental-theories/"},{"name":"Marcus","slug":"Marcus","permalink":"http://example.com/tags/Marcus/"},{"name":"solvent","slug":"solvent","permalink":"http://example.com/tags/solvent/"},{"name":"ions","slug":"ions","permalink":"http://example.com/tags/ions/"}]}