{"meta":{"title":"Study Archive","subtitle":"Student forever","description":"","author":"李紀風","url":"http://example.com","root":"/"},"pages":[{"title":"tags","date":"2023-01-30T13:19:25.000Z","updated":"2023-01-30T13:40:21.184Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"confusing_in_electrochemistry","slug":"confusing-in-electrochemistry","date":"2023-01-30T07:26:22.000Z","updated":"2023-01-30T07:26:22.686Z","comments":true,"path":"2023/01/30/confusing-in-electrochemistry/","link":"","permalink":"http://example.com/2023/01/30/confusing-in-electrochemistry/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Electrode Potential","slug":"electrode-potential","date":"2023-01-30T06:14:30.000Z","updated":"2023-02-01T07:02:01.405Z","comments":true,"path":"2023/01/30/electrode-potential/","link":"","permalink":"http://example.com/2023/01/30/electrode-potential/","excerpt":"Several fundamental properties related to electrode potential","text":"Several fundamental properties related to electrode potential Figure 1: The definition of several potential relate to the surface excess charges and chemical potential of conductor Outer Potential/ Volta Potential Definition: In a vacuum, the electric work done by transferring the unit negative charge from infinity to point away from phase is called the external potential of conductor . The whole process only does electric work. Because the point A is still in vacuum, The short-range force betweem the charged particle (ion, electron, etc.) and conductor has not yet occurred. The outer potential is measurable. Requirements for unit charge \"The unit charge being transported only test (or “probe”) the charge on the metal. The unit test charge must not itself interact with the metal; it should only sense the charge on the metal. It must be a spectator, not an actor.\" \"Modern Electrochemistry 2A\" Surface Potential Definition: The electric work done by transferring the unit negative charge from point away from the conductor phase , across the interface dipole layer, to point C in the phase is called the surface potential of conductor . The whole process only does electric work. Apparently, in this transferring process, there is not only electric work but chemical effect work (chemical potential). However, separating electrical or chemical effect work from the transferring process is impossible. Besides, closely relates to the properties of conductor material and its surface structure. Therefore, is unmeasurable. Figure 2. Causes of metal surface potential In the bulk phase, the density of free electrons is equal everywhere. The electron density in the surface area decreases with the distance from the surface. In the metal surface, the electrons are imbalanced. They tend to come out of the metal surface and enter the vacuum to reduce the kinetic energy. The distance between these electrons and the positive ion nucleus increases, and the potential energy increases. The two factors work together to reach an equilibrium. Spill Over: When the temperature rises, some electrons are excited, and quantum tunneling effect occurs, so they can be distributed within away from the metal surface Chemical Potential Definitoin: The short-rang interaction work done by reversibly transferring the unit molar species from point away from the conductor phase , across the interfacial dipole layer, to point C in the phase is called the chemical potential of conductor . Real Potential Transferring unit molar species with charge number from point away from the conductor phase needs to overcome both surface potential and the chemical potential of the point in phase . Inner Potential/ Galvani Potential Figure 3. Illustration of inner potential Definition: In a vacuum, the electric work done by transferring the unit negative charge from infinite to a point in the phase is called the inner potential. As illustrated in Figure 3, the inner potential is the sum of surface potential and outer potential The electrostatic term associated with crossing the layer of interfacial-orientated dipoles, and another electrostatic term associated with the charge on the phase. Electrochemical Potential Definition:The total work done by reversibly transferring the unit molar species with charge number from the infinity to a point in the phase is equal to the electrochemical potential of species in the phase . The whole process contains long-range work and short-range work, which is The deduced equation decomposes the electrochemical potential to the chemical work and electric work . Work function of metal Definition:The minimal work done by moving an electron from an uncharged conductor in a vacuum to the outer surface in point A. The process must overcome the chemical interaction between electron and inner particles and transport through the interfacial dipole layer. It is the same as that taking an electron from the Fermi energy level of metal to the surface of the metal. According to the definition of the work function, it is surprising to know that it is exactly opposite to the real potential. What is electrode potential? Absolute electrode potential Firstly, we need to think about the equibrilium condition of electrode reaction. Actually, in the interface of electrode and electrolyte in equibrilium state, the competitiveness of oxidation reaction and reduction reaction is equal (shown in Figure 4) Figure 4. The equibrilium condition of electrode reaction The electron exchange (redox reaction) happens between the electrode and redox species. When it reaches equilirium state, the algbra sum of the electrochemical potential of reactant(s) and product(s) (including electrons) is equal to zero Further decomposing the electrochemial potential will lead to the following equation. Since metal is in brimming with electrons, here we suppose the activity of electrons in metal electrode M is equal to 1 (); Besides, in a redox reaction , there always has and \"\" indicates the negative charge of electrons. Therefore, Compared with Nernst equation of redox electrode, we could assuming a expression of absolute electrode potential But is this assumption right? We can rationalize this definition of absolute electrode potential by designing a specific cell as depicted in Figure 5. The and are same kind of meta () for the electrode to be measured (work electrode) and current collector of reference electrode (Ref). Figure 5. The diagram of designed cell The open circuit voltage (OCV) is direct relate to the electrochemial potential difference of both side. The tested OCV from an external circuit is equal to the sum of all theinterficial potential differences inside the cell. $$ E=- E=w_{abs}-{ref}_{abs} $$ To this point, we can say that the definition of absolute electrode potential successfully applys to the specific cell with a same material for the work electrode and the current collector of reference electrode. Further details of the logic explaination can be seen from \"电极过程动力学导论\" by 查全性. How to understand the absolute electrode potential?","categories":[],"tags":[{"name":"fundamental theories","slug":"fundamental-theories","permalink":"http://example.com/tags/fundamental-theories/"}]},{"title":"Thermodynamics of Electrochemistry","slug":"thermodynamics-basic","date":"2023-01-28T16:58:23.000Z","updated":"2023-01-31T07:05:33.726Z","comments":true,"path":"2023/01/29/thermodynamics-basic/","link":"","permalink":"http://example.com/2023/01/29/thermodynamics-basic/","excerpt":"Thermodynamics of reversible batteries Basics of thermodynamics of electrochemistry Faraday's Law During electrolysis, the amount of substance precipitated on the electrode is proportional to the excess charge.","text":"Thermodynamics of reversible batteries Basics of thermodynamics of electrochemistry Faraday's Law During electrolysis, the amount of substance precipitated on the electrode is proportional to the excess charge. Where the faraday constant is The represent the faraday law applied in a more sepecific condition of electrochemial process. The first term is sum of the excess charge of parallel electrochemical reactions. The second term relate to the charging current. Zeroth law of thermodynamics Several phases/systems in contact with each other are in thermal equilibrium condition: all strength properties (temperature, pressure, chemical potential, electrochemical potential) of each phase/system are equal State functions A system is defined by its own state functions and has nothing to do with its history and environment Entropy Definition of statistical thermodynamics where is the number of all microstates in a system, assuming that the probability of each microstate is equal. Another definition relate to termal energy When a system worked externally near reversibility, the exchanged heat with environment is minimal, and cooresponding to the change of entropy. Internal Energy Internal energy of single-phase multi-component system The expression of the internal energy change of the system, including the input heat energy to the system when changing the entropy, the energy change caused by doing the volume work, and the Gibbs free energy (Non-volume work in reverible system) change caused by doing the chemical work when adding some substances to the system. Internal energy of dual-phase multi-component system The change of GIbbs free energy is described as adding substrance into enery phase and summing the total change chemical potential changes of the system . This term can be the result of (electro)chemical reaction for a closed system; Besides, the surface energy (phase interphase free energy) is reprensent as . Surfance energy is not independent of other state functions, the term is not account. Gibbs free energy Gibbs free energy of single-phase multi-component system Generally, the research of electrochemistry is conduct under a isothermo and isopressure conditon. The change of Gibbs free energy can be reduced as In the above case, the chemical reaction inside the system is the sole contribution of the Gibbs free energy change. Similarly, the Gibbs free energy of dual-phase multi-component system State functions description of electrode/electrolyte interface Gibbs free energy descriptor for electrode/electrolyte is better than internal energy. SInce most electrochemical processes happened on the interface is in a condition, and Gibbs free energy is directly related to the non-volume work including electrical work and chemical potential. Gibbs free energy of single-phase charged system Where : inner potential/Galvani potential of the phase; : the excess charge represents the variations in charge associated with the addition of species . In the process of adding the charged substance to the phase, chemical work and electrical work need to be done at the same time. Chemical work and electrical work are occurring at the same time, which is indistinguishable. Thus, the electrochemical potential is defined (note: ). Behind the definition of electrochemical potential, there is a basic assumptions that the phase within the charged particle is large enough, and adding charged particles does not change the internal potential of the modified phase. i.e. is indenpendent of . \"The electrochemical potential is a measure of the work needed to move one mole of ions from a vacuum into a phase, at constant pressure and temperature. Nevertheless, absolutely speaking, it is impossible to add ions to a phase without changing its charge and therefore its outer potential. Consequently, the notion of electrochemical potential defined by this is a virtual one.\" \"ANALYTICAL and PHYSICAL ELECTROCHEMISTRY\" by HubertH .Girault Gibbs free energy of electrochemical system The electrochemical system is usually an open system containing multiphase, multi-component and charged particles, which can exchange materials and energy with the environment. The process in the electrochemical reaction system is usually carried out under constant surface area and isothermal and isopressure of each interface. When equilibrium is achieved, the inner potential of each phase remains unchanged.","categories":[],"tags":[{"name":"fundamental theories","slug":"fundamental-theories","permalink":"http://example.com/tags/fundamental-theories/"}]}],"categories":[],"tags":[{"name":"fundamental theories","slug":"fundamental-theories","permalink":"http://example.com/tags/fundamental-theories/"}]}