{"meta":{"title":"Study Archive","subtitle":"Student forever","description":"","author":"李紀風","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"confusing_in_electrochemistry","slug":"confusing-in-electrochemistry","date":"2023-01-30T07:26:22.000Z","updated":"2023-01-30T07:26:22.686Z","comments":true,"path":"2023/01/30/confusing-in-electrochemistry/","link":"","permalink":"http://example.com/2023/01/30/confusing-in-electrochemistry/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Electrode Potential","slug":"electrode-potential","date":"2023-01-30T06:14:30.000Z","updated":"2023-01-30T10:09:04.466Z","comments":true,"path":"2023/01/30/electrode-potential/","link":"","permalink":"http://example.com/2023/01/30/electrode-potential/","excerpt":"","text":"Electrode potential Several basic properties related to electrode potential Figure 1: The definition of several potential relate to the surface excess charges and chemical potential of conductor Outer Potential/ Volta Potential Definition: In vacuum, the electric work done by transferring the unit negative charge from infinity to point away from phase is called the external potential of conductor . The whole process only do electric work. Because the point A is still in vacuum, The short-range force betweem the charged particle (ion, electron etc.) and conductor () has not yet occurred. The outer potential is measurable. Surface Potential Definition: The electric work done by transferring the unit negative charge from point away from the conductor phase , across the interface dipole layer, to point C in the phase is called the surface potential of conductor . The whole process only do electric work. Apparently, in this transferring process, there are not only electric work but chemical effect work (chemical potential). However, It is impossible to separate electrical work or chemical effect work from the transferring process. Besides, is closely relate to the properties of conductor material and its surface structure. Therefore, is unmeasurable. Figure 2. Causes of metal surface potential In the bulk phase, the density of free electrons is equal everywhere. In the metal surface,the electrons are imbalanced and tend to come out of the surface and enter the vacuum to reduce the kinetic energy. The distance between these electrons and the positive ion nucleus increases, and the potential energy increases. The two factors work together to reach an equilibrium. The electron density in the surface area decreases with the distance from the surface. Spill Over: When the temperature rises, some electrons are excited and quantum tunneling effect occurs, so they can be distributed within 0.1-0.2nm away from the metal surface Chemical Potential","categories":[],"tags":[]},{"title":"Thermodynamics of Electrochemistry","slug":"thermodynamics-basic","date":"2023-01-28T16:58:23.000Z","updated":"2023-01-30T06:16:19.512Z","comments":true,"path":"2023/01/29/thermodynamics-basic/","link":"","permalink":"http://example.com/2023/01/29/thermodynamics-basic/","excerpt":"","text":"Thermodynamics of reversible batteries Basics of thermodynamics of electrochemistry Faraday's Law During electrolysis, the amount of substance precipitated on the electrode is proportional to the excess charge. Where the faraday constant is The represent the faraday law applied in a more sepecific condition of electrochemial process. The first term is sum of the excess charge of parallel electrochemical reactions. The second term relate to the charging current. Zeroth law of thermodynamics Several phases/systems in contact with each other are in thermal equilibrium condition: all strength properties (temperature, pressure, chemical potential, electrochemical potential) of each phase/system are equal State functions A system is defined by its own state functions and has nothing to do with its history and environment Entropy Definition of statistical thermodynamics where is the number of all microstates in a system, assuming that the probability of each microstate is equal. Another definition relate to termal energy When a system worked externally near reversibility, the exchanged heat with environment is minimal, and cooresponding to the change of entropy. Internal Energy Internal energy of single-phase multi-component system The expression of the internal energy change of the system, including the input heat energy to the system when changing the entropy, the energy change caused by doing the volume work, and the Gibbs free energy (Non-volume work in reverible system) change caused by doing the chemical work when adding some substances to the system. Internal energy of dual-phase multi-component system The change of GIbbs free energy is described as adding substrance into enery phase and summing the total change chemical potential changes of the system . This term can be the result of (electro)chemical reaction for a closed system; Besides, the surface energy (phase interphase free energy) is reprensent as . Surfance energy is not independent of other state functions, the term is not account. Gibbs free energy Gibbs free energy of single-phase multi-component system Generally, the research of electrochemistry is conduct under a isothermo and isopressure conditon. The change of Gibbs free energy can be reduced as In the above case, the chemical reaction inside the system is the sole contribution of the Gibbs free energy change. Similarly, the Gibbs free energy of dual-phase multi-component system State functions description of electrode/electrolyte interface Gibbs free energy descriptor for electrode/electrolyte is better than internal energy. SInce most electrochemical processes happened on the interface is in a condition, and Gibbs free energy is directly related to the non-volume work including electrical work and chemical potential. Gibbs free energy of single-phase charged system Where : inner potential/Galvani potential of the phase; : the excess charge represents the variations in charge associated with the addition of species . In the process of adding the charged substance to the phase, chemical work and electrical work need to be done at the same time. Chemical work and electrical work are occurring at the same time, which is indistinguishable. Thus, the electrochemical potential is defined (note: ). Behind the definition of electrochemical potential, there is a basic assumptions that the phase within the charged particle is large enough, and adding charged particles does not change the internal potential of the modified phase. i.e. is indenpendent of . \"The electrochemical potential is a measure of the work needed to move one mole of ions from a vacuum into a phase, at constant pressure and temperature. Nevertheless, absolutely speaking, it is impossible to add ions to a phase without changing its charge and therefore its outer potential. Consequently, the notion of electrochemical potential defined by this is a virtual one.\" \"ANALYTICAL and PHYSICAL ELECTROCHEMISTRY\" by HubertH .Girault Gibbs free energy of electrochemical system The electrochemical system is usually an open system containing multiphase, multi-component and charged particles, which can exchange materials and energy with the environment. The process in the electrochemical reaction system is usually carried out under constant surface area and isothermal and isopressure of each interface. When equilibrium is achieved, the inner potential of each phase remains unchanged.","categories":[],"tags":[]}],"categories":[],"tags":[]}